[
  {
    "id": "mfs_consumer_duty-general-mema_financial_services",
    "policy_key": "mfs_consumer_duty",
    "title": "MEMA Financial Services",
    "body_md": "Consumer Duty Procedure\n| Governance |\n| --- | --- |\n| Version | V1.1 |\n| Approved by | Risk & Compliance Committee |\n| Owner | Compliance Officer |\n| Review Frequency | Annual |\n| Next Review Date | July 2026 |\n\n1. Introduction3\n2. Purpose3\n3. Scope3\n4. Application of the Consumer Duty to MFS3\nScope of the Duty4\nAncillary Services4\n{{firm.name}} acts as a Distributor for the majority of its products and services, including:5\n5. Assessment of Foreseeable Harms6\n6. Assessment of Good Customer Outcomes6\n7. Vulnerable Customer Risk Assessment7\n8. Application of the Four Customer Outcomes and Cross Cutting Rules9\n9. Management Information14",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.563Z"
  },
  {
    "id": "mfs_consumer_duty-introduction-introduction",
    "policy_key": "mfs_consumer_duty",
    "title": "Introduction",
    "body_md": "The Consumer Duty Procedure outlines the processes and principles that guide {{firm.name}}  (“{{firm.name}}”)  in meeting the FCA’s Consumer Duty requirements, aimed at ensuring it consistently delivers good outcomes for its customers.\nThis document details the steps {{firm.name}} takes to assess foreseeable harms, identify and monitor good customer outcomes, and address the specific needs of vulnerable customers. The Consumer Duty Procedure serves as a foundation for embedding high standards of customer care, driving positive impacts, and upholding {{firm.name}}’s regulatory obligations.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.569Z"
  },
  {
    "id": "mfs_consumer_duty-purpose-purpose",
    "policy_key": "mfs_consumer_duty",
    "title": "Purpose",
    "body_md": "The purpose of this document is to set out the procedures and controls {{firm.name}} will implement to ensure compliance with the FCA’s Consumer Duty requirements. It provides a structured framework to guide {{firm.name}}’s efforts in identifying, delivering, and maintaining good customer outcomes across all products and services.\nThis document is intended to support {{firm.name}} in consistently acting in the best interests of its customers, embedding a customer-first approach into all aspects of its operations, and fostering a culture of fairness, transparency, and accountability",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.569Z"
  },
  {
    "id": "mfs_consumer_duty-scope-scope",
    "policy_key": "mfs_consumer_duty",
    "title": "Scope",
    "body_md": "The scope of this Consumer Duty Procedure document covers all products and services provided by {{firm.name}} that fall under the FCA’s Consumer Duty requirements. It applies to all departments and staff involved in product design, marketing, customer service, compliance, risk management, and any other function that may impact customer outcomes.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.569Z"
  },
  {
    "id": "mfs_consumer_duty-application_of_the_consumer_duty_to_mfs-application_of_the_consumer_duty",
    "policy_key": "mfs_consumer_duty",
    "title": "Application of the Consumer Duty to MFS",
    "body_md": "{{firm.name}} has carried out an assessment of the Consumer Duty to determine how the Duty applies to {{firm.name}} and the products and services it provides to customers. {{firm.name}} has appointed a consumer duty champion Misah Maragh.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.569Z"
  },
  {
    "id": "mfs_consumer_duty-application_of_the_consumer_duty_to_mfs_business_model-application_of_th",
    "policy_key": "mfs_consumer_duty",
    "title": "Application of the Consumer Duty to MFS Business Model",
    "body_md": "{{firm.name}} is an FCA regulated firm and provides money remittance products to customers.\nOur money remittance services cater to businesses requiring efficient and secure cross-border transfers, primarily from the UK to key European markets such as Germany and France. By leveraging advanced technology and a customer-centric approach, we ensure seamless, cost-effective transactions that meet regulatory compliance standards.\nOur target market consists of small to medium-sized enterprises (SMEs) engaged in international trade and seeking flexible financial solutions to support their operational and growth needs.\nOur distribution strategy focuses on leveraging digital channels e.g. a secure online platform. This combined offering ensures that {{firm.name}} meets the diverse financial needs of SMEs, supporting their growth and stability in a competitive global market.\n{{firm.name}} has determined that it is within scope of the Consumer Duty and that all the products and services it provides to customers are in scope of the Duty.\n{{firm.name}} has undertaken a detailed assessment to determine its scope under the Consumer Duty framework. As a provider of financial services targeting SME clients, the applicability of the Duty depends on the nature of our products and services, their distribution, and the end-user classification.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.570Z"
  },
  {
    "id": "mfs_consumer_duty-application_of_the_consumer_duty_to_mfs_business_model-scope_of_the_duty",
    "policy_key": "mfs_consumer_duty",
    "title": "Scope of the Duty",
    "body_md": "- Money Remittance Services:{{firm.name}} provides cross-border money remittance services exclusively to B2B clients. While the Consumer Duty primarily applies to retail customers, aspects of our services may fall within the Duty’s scope if deemed to involve micro-enterprises, as these are treated as retail clients under FCA rules.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.570Z"
  },
  {
    "id": "mfs_consumer_duty-application_of_the_consumer_duty_to_mfs_business_model-ancillary_service",
    "policy_key": "mfs_consumer_duty",
    "title": "Ancillary Services",
    "body_md": "- Customer Support:Comprehensive support for clients using our digital platforms to ensure smooth transactions and application processes.\n- Transaction Tracking and Reporting:Secure online tools enabling clients to monitor and manage their remittance transactions.\n- Guidance on Product Selection:Assistance in navigating and selecting appropriate financial solutions, ensuring suitability for their business needs.\nWhile {{firm.name}} predominantly operates in the B2B sector, we acknowledge that aspects of our services may bring us within the scope of the Consumer Duty, particularly for micro-enterprises. Our approach is to align with the Duty’s overarching objectives by delivering products and services that are fair, transparent, and designed to support positive outcomes for all clients, including those potentially classified as retail customers.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.570Z"
  },
  {
    "id": "mfs_consumer_duty-mfs_s_role_under_the_consumer_duty-mfs_s_role_under_the_consumer_duty",
    "policy_key": "mfs_consumer_duty",
    "title": "MFS’s role under the Consumer Duty",
    "body_md": "{{firm.name}} has determined its role under the Consumer Duty framework as primarily a Distributor of financial services.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.570Z"
  },
  {
    "id": "mfs_consumer_duty-mfs_s_role_under_the_consumer_duty-distributor_role",
    "policy_key": "mfs_consumer_duty",
    "title": "Distributor role and responsibilities",
    "body_md": "As a Distributor, {{firm.name}} is responsible for ensuring products and services are delivered to the right target market, customer communications are clear and fair, and outcomes are monitored for foreseeable harm. {{firm.name}} shares relevant MI with manufacturers where applicable, escalates issues in the distribution chain, and maintains oversight of any intermediaries to ensure Consumer Duty obligations are met across the customer journey.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.570Z"
  },
  {
    "id": "mfs_consumer_duty-mfs_s_role_under_the_consumer_duty-mfs_acts_as_a_distributor_for_the_maj",
    "policy_key": "mfs_consumer_duty",
    "title": "MFS acts as a Distributor for the majority of its products and services, including:",
    "body_md": "- Money Remittance Services:{{firm.name}} facilitates cross-border payments by providing a platform that connects SME clients with payment execution services. The service design and operational processes are aligned to meet client needs; however, the core remittance services are standardised offerings, positioning {{firm.name}} as a Distributor rather than a Manufacturer.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.570Z"
  },
  {
    "id": "mfs_consumer_duty-mfs_s_role_under_the_consumer_duty-distribution_chains",
    "policy_key": "mfs_consumer_duty",
    "title": "Distribution Chains",
    "body_md": "MEMA operates as part of a distribution chain for several of its products and services, primarily in the areas of money remittance.\nMEMA distributes financial products and services through established distribution chains, ensuring customers have access to solutions tailored to their business needs:",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.570Z"
  },
  {
    "id": "mfs_consumer_duty-mfs_s_role_under_the_consumer_duty-money_remittance_services",
    "policy_key": "mfs_consumer_duty",
    "title": "Money Remittance Services:",
    "body_md": "MEMA facilitates cross-border payments for SME clients by acting as a Distributor of remittance services. These services are delivered through a digital platform, connecting customers with payment service providers who execute the transactions. MEMA’s role ensures that these services are presented and delivered in a manner consistent with customer expectations and regulatory requirements.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.571Z"
  },
  {
    "id": "mfs_consumer_duty-assessment_of_foreseeable_harms-assessment_of_foreseeable_harms",
    "policy_key": "mfs_consumer_duty",
    "title": "Assessment of Foreseeable Harms",
    "body_md": "In line with the FCA's Consumer Duty expectations, MEMA  has taken steps to identify and mitigate foreseeable harms that could negatively impact customers.\nMEMA has carried out an assessment of foreseeable harms across all stages of the customer journey to identify any risks that could cause detriment. This involves understanding how products or services may interact with the needs, vulnerabilities, and characteristics of different customer groups, especially those who may be at greater risk of harm.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.571Z"
  },
  {
    "id": "mfs_consumer_duty-assessment_of_foreseeable_harms-foreseeable_harms_assessment",
    "policy_key": "mfs_consumer_duty",
    "title": "Foreseeable Harms Assessment",
    "body_md": "The assessment focused on identifying and mitigating risks across MEMA’s core offerings:\nMoney Remittance Services\nForeseeable Harms Identified:\n- Incorrect Transfers: Errors in inputting recipient details could lead to funds being sent to the wrong account.\n- Delayed Transactions: Technical failures or delays in processing could disrupt clients’ business operations.\n- Security Risks: Breaches in data security or unauthorised access to sensitive payment data could expose customers to fraud or financial loss.\n- Misunderstanding of Costs: Customers may not fully understand transfer fees or exchange rate implications, leading to dissatisfaction or financial loss.\nMitigation Measures:\n- Implementation of robust transaction verification processes to minimise input errors.\n- Use of secure and reliable technology to ensure timely and accurate processing.\n- Encryption of sensitive payment data and strict access controls to prevent security breaches.\n- Transparent communication of fees and exchange rates during the transaction process.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.571Z"
  },
  {
    "id": "mfs_consumer_duty-assessment_of_good_customer_outcomes-assessment_of_good_customer_outcome",
    "policy_key": "mfs_consumer_duty",
    "title": "Assessment of Good Customer Outcomes",
    "body_md": "The FCA also expects firms to clearly define what constitutes a \"good outcome\" for customers. Understanding good outcomes involves considering the specific needs, characteristics, and vulnerabilities of the firm’s target customer base, ensuring that products and services are designed to meet these needs effectively.\n{{firm.name}} has conducted a detailed assessment of what constitutes good customer outcomes in line with its commitment to the Consumer Duty. This assessment focused on ensuring that its products and services deliver fair value, meet customer needs, and support positive financial outcomes for SME clients and micro-enterprises.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.571Z"
  },
  {
    "id": "mfs_consumer_duty-good_customer_outcomes_assessment-good_customer_outcomes_assessment",
    "policy_key": "mfs_consumer_duty",
    "title": "Good Customer Outcomes Assessment",
    "body_md": "The assessment considered the following key factors:\nMoney Remittance Services\nGood Outcomes Identified:\n- Accuracy and Reliability: Customers experience smooth and error-free transactions, with funds reaching the intended recipient accurately and on time.\n- Transparency in Costs: Customers fully understand the fees, exchange rates, and overall cost of each transaction, enabling them to make informed financial decisions.\n- Security and Trust: Customers trust {{firm.name}}’s secure handling of sensitive data and are confident that their financial information is protected from breaches or misuse.\n- Ease of Use: Customers can easily navigate the platform, initiate transactions, and track progress with minimal friction.\nMeasures to Ensure Good Outcomes:\n- Regular system testing to maintain accuracy and reliability.\n- Clear presentation of fees and exchange rates at the point of transaction.\n- Use of encryption and access controls to secure customer data.\n- Continuous improvements to platform usability based on customer feedback.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.571Z"
  },
  {
    "id": "mfs_consumer_duty-vulnerable_customer_risk_assessment-vulnerable_customer_risk_assessment",
    "policy_key": "mfs_consumer_duty",
    "title": "Vulnerable Customer Risk Assessment",
    "body_md": "Firms are required to place particular emphasis on the fair treatment of vulnerable customers, ensuring that their unique needs and potential limitations are fully considered at every stage of the customer journey.\nA thorough assessment of vulnerable customers is crucial to identifying areas where they may be at a higher risk of harm, as well as implementing tailored support measures that enable them to achieve the same positive outcomes as other customers.\n{{firm.name}} has conducted a comprehensive assessment of vulnerable customers within its target customer base, focusing on identifying potential vulnerabilities and the specific harms that may arise. This assessment aligns with {{firm.name}}’s commitment to the Consumer Duty and its responsibility to deliver fair and positive outcomes for all customers, including those who may be vulnerable.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.571Z"
  },
  {
    "id": "mfs_consumer_duty-vulnerable_customer_risk_assessment-vulnerable_customer_assessment",
    "policy_key": "mfs_consumer_duty",
    "title": "Vulnerable Customer Assessment",
    "body_md": "Identification of Vulnerable Customers\n{{firm.name}} recognises that vulnerability can arise from a variety of circumstances and has identified key characteristics within its target SME customer base that may indicate potential vulnerability, including:\n- Financial Challenges: Micro-enterprises or SMEs experiencing cash flow issues or financial instability.\n- Limited Digital Literacy: Customers with difficulties navigating digital platforms for remittance.\n- Language Barriers: Non-native English speakers who may struggle to understand product terms or service requirements.\n- Time-Sensitive Needs: Customers requiring urgent transactions, increasing the risk of decision-making under pressure.\n2. Potential Harms Identified\n- Misunderstanding of Terms and Costs: Vulnerable customers may struggle to fully understand fees, exchange rates, or loan terms, leading to unintended financial strain.\n- Fraud or Security Risks: Customers with limited technical knowledge may be more susceptible to fraud or data breaches.\n- Inaccessibility of Support: Vulnerable customers may have difficulties accessing or understanding customer support services, particularly in urgent situations.\nMitigation Measures\n{{firm.name}} has implemented several measures to mitigate potential harms and ensure vulnerable customers are adequately supported:",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.571Z"
  },
  {
    "id": "mfs_consumer_duty-vulnerable_customer_risk_assessment-clear_and_accessible_communication",
    "policy_key": "mfs_consumer_duty",
    "title": "Clear and Accessible Communication:",
    "body_md": "- Simplified and jargon-free explanations of fees, terms, and product features.\n- Translation services or multilingual support for non-native English speakers.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.571Z"
  },
  {
    "id": "mfs_consumer_duty-vulnerable_customer_risk_assessment-enhanced_suitability_checks",
    "policy_key": "mfs_consumer_duty",
    "title": "Enhanced Suitability Checks:",
    "body_md": "- Additional steps in the suitability assessment process to ensure vulnerable customers are matched with appropriate products.\n- Proactive questioning to identify vulnerabilities and adjust recommendations accordingly.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.571Z"
  },
  {
    "id": "mfs_consumer_duty-vulnerable_customer_risk_assessment-secure_and_user_friendly_platforms",
    "policy_key": "mfs_consumer_duty",
    "title": "Secure and User-Friendly Platforms:",
    "body_md": "- Robust data protection measures to safeguard against fraud and unauthorised access.\n- User-friendly digital interfaces designed with accessibility in mind.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.571Z"
  },
  {
    "id": "mfs_consumer_duty-vulnerable_customer_risk_assessment-tailored_customer_support",
    "policy_key": "mfs_consumer_duty",
    "title": "Tailored Customer Support:",
    "body_md": "- Dedicated support channels for vulnerable customers, including one-on-one assistance where necessary.\n- Training for staff to recognise and respond to signs of vulnerability with empathy and professionalism.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.571Z"
  },
  {
    "id": "mfs_consumer_duty-vulnerable_customer_risk_assessment-regular_monitoring_and_feedback",
    "policy_key": "mfs_consumer_duty",
    "title": "Regular Monitoring and Feedback:",
    "body_md": "- Continuous monitoring of customer interactions and outcomes to identify emerging vulnerabilities.\n- Incorporation of feedback from vulnerable customers into product and process improvements.",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.571Z"
  },
  {
    "id": "mfs_consumer_duty-application_of_the_four_customer_outcomes_and_cross_cutting_rules-applic",
    "policy_key": "mfs_consumer_duty",
    "title": "Application of the Four Customer Outcomes and Cross Cutting Rules",
    "body_md": "{{firm.name}} has considered all the aspects of its regulated activities and products and services which are in scope for the Consumer Duty. The following table shows how Consumer Duty has applied across the business, products and services and processes.\n| Objectives | Scope & Actions |\n| --- | --- |\n| Outcomes |\n| Products & Services We have identified our target market as distributors and manufacturers, focusing on SME clients operating in these sectors. Our distribution strategy is tailored to effectively serve our target clients. We will distribute our products through; Digital Platform, Direct Client Engagement, Partnerships and Customer Support We design and recommend products and services that align with the financial needs and objectives of our customers. We take into consideration the needs, objectives and characteristics of vulnerable customers when designing products. We have a product approval process in place We gather and share negative information with partners in the distribution chain. We carry out regular reviews and monitoring to ensure that we are meeting the needs or objectives of our targeted clients, including customers with characteristics of vulnerability. | We will use research systems to identify ideal products for our customers’ specific needs. We will create a series of customer personas, one for each of our target markets. We will provide feedback to our business partners on whether they have created any harm to our customers. We will carry out research with different customer profiles. We will carry out post-sale analysis to assess whether products have performed as expected. |\n| Price & Value When recommending products and services, we consider the benefits that the customer may reasonably expect. We consider any limitations that are part of the product or service. We are able to estimate the total aggregate cost of the proposition for the customer. We always assess whether the relationship between the costs/charges and benefits is fair and reasonable. We will continuously review the fair value assessment to ensure this remains appropriate We will ensure our vulnerable clients receive additional protection. | We will ensure that all our recommendations are presented to offer a benefit to meet a specific need. We will analyse all products/services we offer, identify any limitations and ensure these are highlighted. We will always present our clients with an estimated total cost of their recommendation. We will continuously benchmark the cost of services against similar offerings in the marketplace and make necessary adjustments to our offering or pricing to ensure we continue to provide fair value. We will identify clients with any aspect of vulnerability and test our controls to ensure we do not cause any financial harm. |\n\n| Consumer Understanding We provide information in a timely, accurate and relevant manner. Our customers have a complete understanding of our communications. Our customer communications are clear, fair and not misleading, and enable them to understand their options and make good financial decisions. We consider the target audience and channel of communication We test communications where appropriate to ensure customer understanding Our customer communications are continuously improved. | We will ensure that all marketing and non-marketing material is reviewed at least six monthly to ensure that wording is clear and understandable. We will tailor our communications to the information needs and comprehension of our clients, taking into consideration our vulnerable customers. We will pre-release check all customer communications to ensure they give clear, understandable and timely information and encourage our customers to consider what’s right for them. We will actively gather feedback from our customers on the quality of our communications and continuously improve them. |\n| --- | --- |\n| Consumer Support We deliver the support our customers expect and need from us. We do not introduce unreasonable barriers when dealing with our customers and place their interests first and ahead of any other consideration. We do not charge additional or unreasonable costs to customers We do not intentionally disadvantage any customer or group of customers to the benefit of others. Our pre and post sales service will continuously meet the needs of our customers. | We will routinely ask our customers whether our products meet their expectations. We will appoint a ‘customer champion’ who assesses whether any action we take has an implication for any of our various customer groups. We will monitor how we operate to ensure that we do not advantage one customer over another. Where this comes to light, we will take immediate action. We will provide additional information to customers on our website to help themselves serve. We will monitor the quality of our pre and post-sale support, including analysis of customer surveys, complaints analysis and internal reviews and make improvements. |\n| Objectives | Scope & Actions |\n| Cross Cutting Rules |\n| We act in good faith to our clients We do not exploit our customers’ behavioural biases. We do not communicate in a way which ‘masks’ any benefits and risks. We do not operate in a way which may ‘frustrate’ a customer’s ability to enjoy the product or service we offer. | We will identify behavioural biases and introduce controls to manage them. We will encourage our staff to ‘sound out’ if they feel we have not acted in good faith. We will always support the customers' wishes regarding the services we have provided. |\n| We avoid foreseeable harm for our customers We identify any circumstance where our recommendations may financially harm a customer. We monitor market conditions and act promptly to mitigate any potential harm to our customers. | We will continuously review our new and existing services and let customers know if we plan to make changes to improve customer outcomes. We will take action where market conditions mean that earlier recommendations are no longer appropriate. |\n| Enabling customers to pursue their financial objectives We encourage and facilitate our customers making their own financial decisions. We consider any behavioural biases and/or vulnerabilities when enabling customers to make their own financial decisions. We provide sufficient, clear and timely information our customers may need to make informed decisions. | We will write to customers regularly about a range of financial matters, provide them with understandable fact-based information and ask them to consider the implications for them. We don’t make financial decisions on behalf of customers – we only provide information to enable them to confidently make decisions and warn them of any potential biases they may have. |",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.571Z"
  },
  {
    "id": "mfs_consumer_duty-management_information-management_information",
    "policy_key": "mfs_consumer_duty",
    "title": "Management Information",
    "body_md": "The following table provides a list of management information aligned to the Duty which will be used to assess {{firm.name}}’s adherence to the Duty.\n| Requirements | Explanation | Management Information | Reviewed By |\n| --- | --- | --- | --- |\n| Four Outcomes of Consumer Duty |\n| Products & services | Current products and services offered as fit for purpose. These need to be designed to meet different customer needs and appropriately targeted at customers whose needs must be met. | Post sale research on customer’s perception of whether the service goes towards meeting their specified need(s). File reviews Sales performance information Analysis of product performance against expectations Customer surveys Complaints & Root Cause Analysis Refund analysis | Board |\n| Price & value | Products and services are designed based on them offering ‘fair value’ in terms of cost vs benefit in financial and non-financial terms. | Analysis of the marketplace and identification of whether the product or service still offers ‘fair value’. Post sale research on customer’s perception of fair value. Profitability data on service Customer reviews/ social media Customer usage data Associated fees and charges Complaints & Root Cause Analysis | Board |\n| Consumer understanding | The FCA expects communications to customers to empower them to make informed decisions about financial products and services the firm offers. | Post sales research on customer’s perception of the firm’s communications and how this has enabled customers to make informed decisions. Independent Reviews Complaints & Root Cause Analysis Customer Surveys Sales performance trends Unsubscribes rates Cancellation/ customer retention rates | Board |\n| Consumer support | The regulator requires firms to provide a level of service where its customers’ needs are met throughout their relationship with the firm. | Ongoing gathering of feedback on the level of service provided. Call listening feedback Speed of response Product cancellation rates Customer surveys Complaints & Root Cause Analysis Internal quality assurance on post-sale support | Board |\n| Annual Consumer Duty Board Report |\n| Monitoring of outcomes report | An annual report must be provided and approved by the Board. This is required by PRIN 2A.8.3 – 5. | At least annually, the governing body of a firm must: (1) review and approve the firm’s report on the outcomes being received by retail customers; (2) confirm whether it is satisfied that the firm is complying with its obligations under Principle 12 and PRIN 2A; and (3) assess whether the firm’s future business strategy is consistent with its obligations under Principle 12 and PRIN 2A. When approving the firm’s report under PRIN 2A.8.4R(1), the governing body of the firm must also agree: (1) any action required to address any identified risk that retail customers may not receive good outcomes; (2) any action required to address any identified instance where retail customers have not received good outcomes; and (3) any amendments to the firm’s business strategy to ensure that it remains consistent with meeting the firm’s obligations under Principle 12 and PRIN 2A. |",
    "tags": {
      "source": [
        "docx"
      ]
    },
    "variables": [],
    "version": "1.0.0",
    "status": "active",
    "source_template_filename": "MFS_Consumer Duty Procedure_V1.docx",
    "source_extracted_at": "2025-12-14T02:43:05.572Z"
  }
]
